#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес; 
	Элементы.АнализОтпусковТаблицаТочка.Заголовок = "Сотрудники";
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес); 
	    
    Для каждого Элемент Из ОтпускаСотрудников Цикл
         
    	 Точка = АнализОтпусков.УстановитьТочку(Элемент.Имя);
		 Точка.Текст = Элемент.Имя; 
		  
         Серия = АнализОтпусков.УстановитьСерию("Отпуск");
		 Серия.Текст = "Ежегодный отпуск";
		 
         ЗначениеДГ = АнализОтпусков.ПолучитьЗначение(Точка, Серия);  
        
         Интервал = ЗначениеДГ.Добавить(); 
         Интервал.Начало = Элемент.Начало; 
         Интервал.Конец = Элемент.Конец; 

    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти