
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
	#Область ОбработчикиСобытийМодуляОбъекта
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		Для каждого Строка Из ОтпускаСотрудников Цикл   
			
			Если НЕ ЗначениеЗаполнено(Строка.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
				Отказ = Истина;  
			КонецЕсли; 
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ВКМ_УчетОтпусков.Записывать = Истина;
		
		Для каждого Строка Из ОтпускаСотрудников Цикл
			
			Движение = Движения.ВКМ_УчетОтпусков.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Значение = 1 + (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
			
		КонецЦикла;    
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли